#include<bits/stdc++.h>

//My codes-------------->>>>
#define vi vector<int>
#define vl vector<ll>
#define vc vector<char>
#define vii vector<vi>
#define vcc vector<vc>
#define ll long long
#define ld long double
#define sortx(X) sort(X.begin(),X.end());

using namespace std;

void FP()
{
	ios_base::sync_with_stdio(false), cin.tie(nullptr), cout.tie(nullptr);
}

ll samm(ll n) {
	return (n * (n + 1)) / 2;
}
ll mod2(ll t) {
	ll summ = 0;
	while (t % 2 == 0)
	{
		t /= 2;
		summ++;
	}
	return summ;
}
void solve() {
	ll n, m ,a=0,b=0;
	cin >> n >> m;
	if (m % n != 0)
	{
		cout << -1;
		return;
	}
	m /= n;
	while (m%2==0)
	{
		a++;
		m /= 2;
	}
	while (m%3==0)
	{
		b++;
		m /= 3;
	}
	if (m!= 1)
	{
		cout << -1;
	}else cout << a + b;
}

int main()
{
	FP();
	int size = 1;
	//cin >> size;
	while (size--)
	{
		solve();
	}
}

/*
███████╗██╗   ██╗ █████╗ ██████╗   ██╗  ██╗ █████╗ ███╗  ██╗██╗   ██╗
╚════██║╚██╗ ██╔╝██╔══██╗██╔══██╗  ██║  ██║██╔══██╗████╗ ██║╚██╗ ██╔╝
	███╔═╝ ╚████╔╝ ███████║██║  ██║  ███████║███████║██╔██╗██║ ╚████╔╝
██╔══╝    ╚██╔╝  ██╔══██║██║  ██║  ██╔══██║██╔══██║██║╚████║  ╚██╔╝
███████╗   ██║   ██║  ██║██████╔╝  ██║  ██║██║  ██║██║ ╚███║   ██║
╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═════╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚══╝   ╚═╝
*/
