#include<bits/stdc++.h>
#include <fstream>
#include <cstdlib>
#include<conio.h>
#include <windows.h>
#include <stdlib.h>
#include <time.h>
#define pb push_back
#define ll long long
#define dbl double
#define srt(massiv) sort(massiv.begin(),massiv.end())
#define rvrs(massiv) reverse(massiv.begin(),massiv.end())
#define srtr(massiv) sort(massiv.rbegin(),massiv.rend())
#define yes cout<<"yes"<<endl
#define no cout<<"no"<<endl
#define Yes cout<<"Yes"<<endl
#define No cout<<"No"<<endl
#define YES cout<<"YES"<<endl
#define NO cout<<"NO"<<endl
#define en "\n"
#define Minecraft for(cin>>MC;MC--;)
#define ReallyWorld ios_base::sync_with_stdio(false), cin.tie(0), cout.tie(0);
using namespace std;
/// cout << fixed << X ;
///ifstream cin("input.txt");
///ofstream cout("output.txt")  ;
ll cnt,qnt,cns,qns,n,m,k,i,j,T,x,y,z,a,b,MC;
ll arr1 [100005];
ll arr2 [100005];
main()
{
    ReallyWorld
    map<string,ll> mp;
    cin >> n >> m;
    vector<string>s(n),L, R;
    for (i = 0; i < n; i++)
    {
        cin >> s[i];
        mp[s[i]]++;
    }
    string M;
    for (i = 0; i < n; i++)
    {
        string t = s[i];
        reverse(t.begin(), t.end());
        if (t == s[i])
            M = t;
        else if (mp.find(t) != mp.end())
        {
            L.push_back(s[i]);
            R.push_back(t);
            mp.erase(s[i]);
            mp.erase(t);
        }
    }
    cout << L.size() * m * 2 + M.size() << en;
    for (string x : L)
        cout << x;
    cout << M;
    rvrs(R);
    for (string x : R)
        cout << x;
    cout << en;

}
/**
███╗   ███╗███████╗██████╗ ██╗███╗  ██╗███████╗███████╗███████╗███╗   ███╗
████╗ ████║██╔════╝██╔══██╗██║████╗ ██║██╔════╝██╔════╝██╔════╝████╗ ████║
██╔████╔██║█████╗  ██████╦╝██║██╔██╗██║█████╗  █████╗  █████╗  ██╔████╔██║
██║╚██╔╝██║██╔══╝  ██╔══██╗██║██║╚████║██╔══╝  ██╔══╝  ██╔══╝  ██║╚██╔╝██║
██║ ╚═╝ ██║███████╗██████╦╝██║██║ ╚███║███████╗███████╗███████╗██║ ╚═╝ ██║
╚═╝     ╚═╝╚══════╝╚═════╝ ╚═╝╚═╝  ╚══╝╚══════╝╚══════╝╚══════╝╚═╝     ╚═╝

        ▄▄▄    ▄▄██▄▄
       ████▄  ███████
       █████▄████████
       ▀█████████████
     ▄▄    ▀▀▀██████▄██████▄▄
  ▄████  ███    ▀████████████
▄██████  ▀▀▀ ▄█  ▀███████████
▀▀       █▄▄███   █████████▀
  ▀█████ ▀███▀▀   ██████▀
       ██▄        ███████▄
      █████       ████████▄
    ▄██████       ▀███████▀
   ████████        ▀████▀
  █████████
  ████████▀
  ▀██████▀
    ▀▀▀
**/
